In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
df = pd.read_csv('wine_data.csv', header=None, usecols= [0,1,2])
df.columns = ['label', 'alcohol', 'malic acid']

In [23]:
df

     label  alcohol  malic acid
0        1    14.23        1.71
1        1    13.20        1.78
2        1    13.16        2.36
3        1    14.37        1.95
4        1    13.24        2.59
..     ...      ...         ...
173      3    13.71        5.65
174      3    13.40        3.91
175      3    13.27        4.28
176      3    13.17        2.59
177      3    14.13        4.10

[178 rows x 3 columns]

In [25]:
df = df.iloc[:,1:2]

In [27]:
df

     alcohol
0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
..       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13

[178 rows x 1 columns]

In [44]:
def meannomralization(column):
    mean = column.mean()
    max = column.max()
    min = column.min()
    return (column - mean)/(max-min)

In [46]:
df['normalized']=meannomralization(df['alcohol'])

In [48]:
df

     alcohol  normalized
0      14.23    0.323522
1      13.20    0.052469
2      13.16    0.041943
3      14.37    0.360364
4      13.24    0.062995
..       ...         ...
173    13.71    0.186679
174    13.40    0.105101
175    13.27    0.070890
176    13.17    0.044574
177    14.13    0.297206

[178 rows x 2 columns]

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   alcohol     178 non-null    float64
 1   normalized  178 non-null    float64
dtypes: float64(2)
memory usage: 2.9 KB

In [52]:
np.round(df['normalized'].describe(),1)

count    178.0
mean      -0.0
std        0.2
min       -0.5
25%       -0.2
50%        0.0
75%        0.2
max        0.5
Name: normalized, dtype: float64

In [56]:
df['alcohol'].mean()

13.00061797752809

In [58]:
np.round(df['alcohol'].describe(), 1)

count    178.0
mean      13.0
std        0.8
min       11.0
25%       12.4
50%       13.0
75%       13.7
max       14.8
Name: alcohol, dtype: float64

In [64]:
df

     alcohol  normalized
0      14.23    0.323522
1      13.20    0.052469
2      13.16    0.041943
3      14.37    0.360364
4      13.24    0.062995
..       ...         ...
173    13.71    0.186679
174    13.40    0.105101
175    13.27    0.070890
176    13.17    0.044574
177    14.13    0.297206

[178 rows x 2 columns]